Number of available GPUs: 1
[PhysicalDevice(name='/physical_device:GPU:0', device_type='GPU')]


using single GPU setup
Time: 18Oct2020_13_21_49


Number of available GPUs: 1
[PhysicalDevice(name='/physical_device:GPU:0', device_type='GPU')]


Tesla V100-PCIE-32GB
using single GPU setup


   Training ParticleNet on  25 jet constituents features (particle_net)    
   and on  10 jet high level features    


['energy', 'pt', 'isTrack', 'nHits', 'nPixelHits']
5  training features


['etarel', 'phirel']
2  points coordinates


['pt']
1  mask


['Jet_nSelectedTracks', 'Jet_timeRecHitsEB', 'Jet_timeRecHitsHB', 'Jet_energyRecHitsEB', 'Jet_energyRecHitsHB', 'Jet_nRecHitsEB', 'Jet_nRecHitsHB', 'Jet_ptAllTracks', 'Jet_ptPVTracksMax', 'Jet_betaMax', 'Jet_gammaMaxET', 'Jet_minDeltaRAllTracks', 'Jet_minDeltaRPVTracks']
13  jet features




    Evaluating performances of the model.....   
    Remove negative weights at testing!!!!!!
    Loading model...  /nfs/dust/cms/user/heikenju/ML_LLP/GraphNetJetTaggerCalo/model_weights_graphnet/v3_calo_AOD_2018_v4/model_particle_net_jet_10-4/best_model_10-4.h5


Model: "ParticleNetJet"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
mask (InputLayer)               [(None, 25, 1)]      0                                            
__________________________________________________________________________________________________
tf_op_layer_Greater (TensorFlow (None, 25, 1)        0           mask[0][0]                       
__________________________________________________________________________________________________
tf_op_layer_Cast (TensorFlowOpL (None, 25, 1)        0           tf_op_layer_Greater[0][0]        
__________________________________________________________________________________________________
tf_op_layer_LessEqual (TensorFl (None, 25, 1)        0           tf_op_layer_Cast[0][0]           
__________________________________________________________________________________________________
tf_op_layer_Cast_1 (TensorFlowO (None, 25, 1)        0           tf_op_layer_LessEqual[0][0]      
__________________________________________________________________________________________________
tf_op_layer_Mul (TensorFlowOpLa (None, 25, 1)        0           tf_op_layer_Cast_1[0][0]         
__________________________________________________________________________________________________
points (InputLayer)             [(None, 25, 2)]      0                                            
__________________________________________________________________________________________________
tf_op_layer_Add (TensorFlowOpLa (None, 25, 2)        0           tf_op_layer_Mul[0][0]            
                                                                 points[0][0]                     
__________________________________________________________________________________________________
tf_op_layer_strided_slice_3 (Te (None, 25, 1)        0           tf_op_layer_Add[0][0]            
__________________________________________________________________________________________________
tf_op_layer_strided_slice_2 (Te (None, 25, 1)        0           tf_op_layer_Add[0][0]            
__________________________________________________________________________________________________
tf_op_layer_transpose_2 (Tensor (None, 1, 25)        0           tf_op_layer_strided_slice_3[0][0]
__________________________________________________________________________________________________
tf_op_layer_mul_4 (TensorFlowOp (None, 25, 1)        0           tf_op_layer_strided_slice_2[0][0]
                                                                 tf_op_layer_strided_slice_2[0][0]
__________________________________________________________________________________________________
tf_op_layer_MatMul_1 (TensorFlo (None, 25, 25)       0           tf_op_layer_strided_slice_2[0][0]
                                                                 tf_op_layer_transpose_2[0][0]    
__________________________________________________________________________________________________
tf_op_layer_mul_5 (TensorFlowOp (None, 25, 1)        0           tf_op_layer_strided_slice_3[0][0]
                                                                 tf_op_layer_strided_slice_3[0][0]
__________________________________________________________________________________________________
tf_op_layer_Sum_2 (TensorFlowOp (None, 25, 1)        0           tf_op_layer_mul_4[0][0]          
__________________________________________________________________________________________________
tf_op_layer_mul_6 (TensorFlowOp (None, 25, 25)       0           tf_op_layer_MatMul_1[0][0]       
__________________________________________________________________________________________________
tf_op_layer_Sum_3 (TensorFlowOp (None, 25, 1)        0           tf_op_layer_mul_5[0][0]          
__________________________________________________________________________________________________
tf_op_layer_sub_1 (TensorFlowOp (None, 25, 25)       0           tf_op_layer_Sum_2[0][0]          
                                                                 tf_op_layer_mul_6[0][0]          
__________________________________________________________________________________________________
tf_op_layer_transpose_3 (Tensor (None, 1, 25)        0           tf_op_layer_Sum_3[0][0]          
__________________________________________________________________________________________________
tf_op_layer_add_2 (TensorFlowOp (None, 25, 25)       0           tf_op_layer_sub_1[0][0]          
                                                                 tf_op_layer_transpose_3[0][0]    
__________________________________________________________________________________________________
tf_op_layer_strided_slice_1 (Te (None, 25, 1)        0           tf_op_layer_Add[0][0]            
__________________________________________________________________________________________________
tf_op_layer_Sqrt (TensorFlowOpL (None, 25, 25)       0           tf_op_layer_add_2[0][0]          
__________________________________________________________________________________________________
tf_op_layer_Greater_1 (TensorFl (None, 25, 25)       0           tf_op_layer_add_2[0][0]          
__________________________________________________________________________________________________
tf_op_layer_strided_slice (Tens (None, 25, 1)        0           tf_op_layer_Add[0][0]            
__________________________________________________________________________________________________
tf_op_layer_transpose (TensorFl (None, 1, 25)        0           tf_op_layer_strided_slice_1[0][0]
__________________________________________________________________________________________________
tf_op_layer_mul_8 (TensorFlowOp (None, 25, 25)       0           tf_op_layer_Sqrt[0][0]           
__________________________________________________________________________________________________
tf_op_layer_Cast_2 (TensorFlowO (None, 25, 25)       0           tf_op_layer_Greater_1[0][0]      
__________________________________________________________________________________________________
features (InputLayer)           [(None, 25, 5)]      0                                            
__________________________________________________________________________________________________
tf_op_layer_mul_1 (TensorFlowOp (None, 25, 1)        0           tf_op_layer_strided_slice[0][0]  
                                                                 tf_op_layer_strided_slice[0][0]  
__________________________________________________________________________________________________
tf_op_layer_MatMul (TensorFlowO (None, 25, 25)       0           tf_op_layer_strided_slice[0][0]  
                                                                 tf_op_layer_transpose[0][0]      
__________________________________________________________________________________________________
tf_op_layer_mul_2 (TensorFlowOp (None, 25, 1)        0           tf_op_layer_strided_slice_1[0][0]
                                                                 tf_op_layer_strided_slice_1[0][0]
__________________________________________________________________________________________________
tf_op_layer_sub_2 (TensorFlowOp (None, 25, 25)       0           tf_op_layer_add_2[0][0]          
                                                                 tf_op_layer_mul_8[0][0]          
__________________________________________________________________________________________________
tf_op_layer_Equal (TensorFlowOp (None, 25, 25)       0           tf_op_layer_Cast_2[0][0]         
__________________________________________________________________________________________________
tf_op_layer_ExpandDims (TensorF (None, 25, 1, 5)     0           features[0][0]                   
__________________________________________________________________________________________________
tf_op_layer_Sum (TensorFlowOpLa (None, 25, 1)        0           tf_op_layer_mul_1[0][0]          
__________________________________________________________________________________________________
tf_op_layer_mul_3 (TensorFlowOp (None, 25, 25)       0           tf_op_layer_MatMul[0][0]         
__________________________________________________________________________________________________
tf_op_layer_Sum_1 (TensorFlowOp (None, 25, 1)        0           tf_op_layer_mul_2[0][0]          
__________________________________________________________________________________________________
tf_op_layer_add_3 (TensorFlowOp (None, 25, 25)       0           tf_op_layer_sub_2[0][0]          
__________________________________________________________________________________________________
tf_op_layer_Cast_3 (TensorFlowO (None, 25, 25)       0           tf_op_layer_Equal[0][0]          
__________________________________________________________________________________________________
ParticleNetJet_fts_bn (BatchNor (None, 25, 1, 5)     20          tf_op_layer_ExpandDims[0][0]     
__________________________________________________________________________________________________
tf_op_layer_sub (TensorFlowOpLa (None, 25, 25)       0           tf_op_layer_Sum[0][0]            
                                                                 tf_op_layer_mul_3[0][0]          
__________________________________________________________________________________________________
tf_op_layer_transpose_1 (Tensor (None, 1, 25)        0           tf_op_layer_Sum_1[0][0]          
__________________________________________________________________________________________________
tf_op_layer_Mul_9 (TensorFlowOp (None, 25, 25)       0           tf_op_layer_add_3[0][0]          
                                                                 tf_op_layer_Cast_2[0][0]         
__________________________________________________________________________________________________
tf_op_layer_Mul_7 (TensorFlowOp (None, 25, 25)       0           tf_op_layer_add_2[0][0]          
                                                                 tf_op_layer_Cast_3[0][0]         
__________________________________________________________________________________________________
tf_op_layer_Squeeze (TensorFlow (None, 25, 5)        0           ParticleNetJet_fts_bn[0][0]      
__________________________________________________________________________________________________
tf_op_layer_add_1 (TensorFlowOp (None, 25, 25)       0           tf_op_layer_sub[0][0]            
                                                                 tf_op_layer_transpose_1[0][0]    
__________________________________________________________________________________________________
tf_op_layer_Add_4 (TensorFlowOp (None, 25, 25)       0           tf_op_layer_Mul_9[0][0]          
                                                                 tf_op_layer_Mul_7[0][0]          
__________________________________________________________________________________________________
tf_op_layer_Shape (TensorFlowOp (3,)                 0           tf_op_layer_Squeeze[0][0]        
__________________________________________________________________________________________________
tf_op_layer_Add_5 (TensorFlowOp (None, 25, 25)       0           tf_op_layer_add_1[0][0]          
                                                                 tf_op_layer_Add_4[0][0]          
__________________________________________________________________________________________________
tf_op_layer_strided_slice_5 (Te ()                   0           tf_op_layer_Shape[0][0]          
__________________________________________________________________________________________________
tf_op_layer_Neg (TensorFlowOpLa (None, 25, 25)       0           tf_op_layer_Add_5[0][0]          
__________________________________________________________________________________________________
tf_op_layer_range (TensorFlowOp (None,)              0           tf_op_layer_strided_slice_5[0][0]
__________________________________________________________________________________________________
tf_op_layer_TopKV2 (TensorFlowO [(None, 25, 6), (Non 0           tf_op_layer_Neg[0][0]            
__________________________________________________________________________________________________
tf_op_layer_Reshape (TensorFlow (None, 1, 1, 1)      0           tf_op_layer_range[0][0]          
__________________________________________________________________________________________________
tf_op_layer_strided_slice_4 (Te (None, 25, 5)        0           tf_op_layer_TopKV2[0][1]         
__________________________________________________________________________________________________
tf_op_layer_Tile (TensorFlowOpL (None, 25, 5, 1)     0           tf_op_layer_Reshape[0][0]        
__________________________________________________________________________________________________
tf_op_layer_ExpandDims_1 (Tenso (None, 25, 5, 1)     0           tf_op_layer_strided_slice_4[0][0]
__________________________________________________________________________________________________
tf_op_layer_ExpandDims_2 (Tenso (None, 25, 1, 5)     0           tf_op_layer_Squeeze[0][0]        
__________________________________________________________________________________________________
tf_op_layer_concat (TensorFlowO (None, 25, 5, 2)     0           tf_op_layer_Tile[0][0]           
                                                                 tf_op_layer_ExpandDims_1[0][0]   
__________________________________________________________________________________________________
tf_op_layer_Tile_1 (TensorFlowO (None, 25, 5, 5)     0           tf_op_layer_ExpandDims_2[0][0]   
__________________________________________________________________________________________________
tf_op_layer_GatherNd (TensorFlo (None, 25, 5, 5)     0           tf_op_layer_Squeeze[0][0]        
                                                                 tf_op_layer_concat[0][0]         
__________________________________________________________________________________________________
tf_op_layer_Sub_3 (TensorFlowOp (None, 25, 5, 5)     0           tf_op_layer_GatherNd[0][0]       
                                                                 tf_op_layer_Tile_1[0][0]         
__________________________________________________________________________________________________
tf_op_layer_concat_1 (TensorFlo (None, 25, 5, 10)    0           tf_op_layer_Tile_1[0][0]         
                                                                 tf_op_layer_Sub_3[0][0]          
__________________________________________________________________________________________________
ParticleNetJet_EdgeConv0_conv0  (None, 25, 5, 64)    640         tf_op_layer_concat_1[0][0]       
__________________________________________________________________________________________________
ParticleNetJet_EdgeConv0_bn0 (B (None, 25, 5, 64)    256         ParticleNetJet_EdgeConv0_conv0[0]
__________________________________________________________________________________________________
ParticleNetJet_EdgeConv0_act0 ( (None, 25, 5, 64)    0           ParticleNetJet_EdgeConv0_bn0[0][0
__________________________________________________________________________________________________
ParticleNetJet_EdgeConv0_conv1  (None, 25, 5, 64)    4096        ParticleNetJet_EdgeConv0_act0[0][
__________________________________________________________________________________________________
ParticleNetJet_EdgeConv0_bn1 (B (None, 25, 5, 64)    256         ParticleNetJet_EdgeConv0_conv1[0]
__________________________________________________________________________________________________
ParticleNetJet_EdgeConv0_act1 ( (None, 25, 5, 64)    0           ParticleNetJet_EdgeConv0_bn1[0][0
__________________________________________________________________________________________________
tf_op_layer_ExpandDims_3 (Tenso (None, 25, 1, 5)     0           tf_op_layer_Squeeze[0][0]        
__________________________________________________________________________________________________
ParticleNetJet_EdgeConv0_conv2  (None, 25, 5, 64)    4096        ParticleNetJet_EdgeConv0_act1[0][
__________________________________________________________________________________________________
ParticleNetJet_EdgeConv0_sc_con (None, 25, 1, 64)    320         tf_op_layer_ExpandDims_3[0][0]   
__________________________________________________________________________________________________
ParticleNetJet_EdgeConv0_bn2 (B (None, 25, 5, 64)    256         ParticleNetJet_EdgeConv0_conv2[0]
__________________________________________________________________________________________________
ParticleNetJet_EdgeConv0_sc_bn  (None, 25, 1, 64)    256         ParticleNetJet_EdgeConv0_sc_conv[
__________________________________________________________________________________________________
ParticleNetJet_EdgeConv0_act2 ( (None, 25, 5, 64)    0           ParticleNetJet_EdgeConv0_bn2[0][0
__________________________________________________________________________________________________
tf_op_layer_Squeeze_1 (TensorFl (None, 25, 64)       0           ParticleNetJet_EdgeConv0_sc_bn[0]
__________________________________________________________________________________________________
tf_op_layer_Mean (TensorFlowOpL (None, 25, 64)       0           ParticleNetJet_EdgeConv0_act2[0][
__________________________________________________________________________________________________
tf_op_layer_add_6 (TensorFlowOp (None, 25, 64)       0           tf_op_layer_Squeeze_1[0][0]      
                                                                 tf_op_layer_Mean[0][0]           
__________________________________________________________________________________________________
ParticleNetJet_EdgeConv0_sc_act (None, 25, 64)       0           tf_op_layer_add_6[0][0]          
__________________________________________________________________________________________________
tf_op_layer_Add_7 (TensorFlowOp (None, 25, 64)       0           tf_op_layer_Mul[0][0]            
                                                                 ParticleNetJet_EdgeConv0_sc_act[0
__________________________________________________________________________________________________
tf_op_layer_transpose_4 (Tensor (None, 64, 25)       0           tf_op_layer_Add_7[0][0]          
__________________________________________________________________________________________________
tf_op_layer_mul_10 (TensorFlowO (None, 25, 64)       0           tf_op_layer_Add_7[0][0]          
                                                                 tf_op_layer_Add_7[0][0]          
__________________________________________________________________________________________________
tf_op_layer_MatMul_2 (TensorFlo (None, 25, 25)       0           tf_op_layer_Add_7[0][0]          
                                                                 tf_op_layer_transpose_4[0][0]    
__________________________________________________________________________________________________
tf_op_layer_mul_11 (TensorFlowO (None, 25, 64)       0           tf_op_layer_Add_7[0][0]          
                                                                 tf_op_layer_Add_7[0][0]          
__________________________________________________________________________________________________
tf_op_layer_Sum_4 (TensorFlowOp (None, 25, 1)        0           tf_op_layer_mul_10[0][0]         
__________________________________________________________________________________________________
tf_op_layer_mul_12 (TensorFlowO (None, 25, 25)       0           tf_op_layer_MatMul_2[0][0]       
__________________________________________________________________________________________________
tf_op_layer_Sum_5 (TensorFlowOp (None, 25, 1)        0           tf_op_layer_mul_11[0][0]         
__________________________________________________________________________________________________
tf_op_layer_sub_4 (TensorFlowOp (None, 25, 25)       0           tf_op_layer_Sum_4[0][0]          
                                                                 tf_op_layer_mul_12[0][0]         
__________________________________________________________________________________________________
tf_op_layer_transpose_5 (Tensor (None, 1, 25)        0           tf_op_layer_Sum_5[0][0]          
__________________________________________________________________________________________________
tf_op_layer_Shape_1 (TensorFlow (3,)                 0           ParticleNetJet_EdgeConv0_sc_act[0
__________________________________________________________________________________________________
tf_op_layer_add_8 (TensorFlowOp (None, 25, 25)       0           tf_op_layer_sub_4[0][0]          
                                                                 tf_op_layer_transpose_5[0][0]    
__________________________________________________________________________________________________
tf_op_layer_strided_slice_7 (Te ()                   0           tf_op_layer_Shape_1[0][0]        
__________________________________________________________________________________________________
tf_op_layer_Neg_1 (TensorFlowOp (None, 25, 25)       0           tf_op_layer_add_8[0][0]          
__________________________________________________________________________________________________
tf_op_layer_range_1 (TensorFlow (None,)              0           tf_op_layer_strided_slice_7[0][0]
__________________________________________________________________________________________________
tf_op_layer_TopKV2_1 (TensorFlo [(None, 25, 6), (Non 0           tf_op_layer_Neg_1[0][0]          
__________________________________________________________________________________________________
tf_op_layer_Reshape_1 (TensorFl (None, 1, 1, 1)      0           tf_op_layer_range_1[0][0]        
__________________________________________________________________________________________________
tf_op_layer_strided_slice_6 (Te (None, 25, 5)        0           tf_op_layer_TopKV2_1[0][1]       
__________________________________________________________________________________________________
tf_op_layer_Tile_2 (TensorFlowO (None, 25, 5, 1)     0           tf_op_layer_Reshape_1[0][0]      
__________________________________________________________________________________________________
tf_op_layer_ExpandDims_4 (Tenso (None, 25, 5, 1)     0           tf_op_layer_strided_slice_6[0][0]
__________________________________________________________________________________________________
tf_op_layer_ExpandDims_5 (Tenso (None, 25, 1, 64)    0           ParticleNetJet_EdgeConv0_sc_act[0
__________________________________________________________________________________________________
tf_op_layer_concat_2 (TensorFlo (None, 25, 5, 2)     0           tf_op_layer_Tile_2[0][0]         
                                                                 tf_op_layer_ExpandDims_4[0][0]   
__________________________________________________________________________________________________
tf_op_layer_Tile_3 (TensorFlowO (None, 25, 5, 64)    0           tf_op_layer_ExpandDims_5[0][0]   
__________________________________________________________________________________________________
tf_op_layer_GatherNd_1 (TensorF (None, 25, 5, 64)    0           ParticleNetJet_EdgeConv0_sc_act[0
                                                                 tf_op_layer_concat_2[0][0]       
__________________________________________________________________________________________________
tf_op_layer_Sub_5 (TensorFlowOp (None, 25, 5, 64)    0           tf_op_layer_GatherNd_1[0][0]     
                                                                 tf_op_layer_Tile_3[0][0]         
__________________________________________________________________________________________________
tf_op_layer_concat_3 (TensorFlo (None, 25, 5, 128)   0           tf_op_layer_Tile_3[0][0]         
                                                                 tf_op_layer_Sub_5[0][0]          
__________________________________________________________________________________________________
ParticleNetJet_EdgeConv1_conv0  (None, 25, 5, 128)   16384       tf_op_layer_concat_3[0][0]       
__________________________________________________________________________________________________
ParticleNetJet_EdgeConv1_bn0 (B (None, 25, 5, 128)   512         ParticleNetJet_EdgeConv1_conv0[0]
__________________________________________________________________________________________________
ParticleNetJet_EdgeConv1_act0 ( (None, 25, 5, 128)   0           ParticleNetJet_EdgeConv1_bn0[0][0
__________________________________________________________________________________________________
ParticleNetJet_EdgeConv1_conv1  (None, 25, 5, 128)   16384       ParticleNetJet_EdgeConv1_act0[0][
__________________________________________________________________________________________________
ParticleNetJet_EdgeConv1_bn1 (B (None, 25, 5, 128)   512         ParticleNetJet_EdgeConv1_conv1[0]
__________________________________________________________________________________________________
ParticleNetJet_EdgeConv1_act1 ( (None, 25, 5, 128)   0           ParticleNetJet_EdgeConv1_bn1[0][0
__________________________________________________________________________________________________
tf_op_layer_ExpandDims_6 (Tenso (None, 25, 1, 64)    0           ParticleNetJet_EdgeConv0_sc_act[0
__________________________________________________________________________________________________
ParticleNetJet_EdgeConv1_conv2  (None, 25, 5, 128)   16384       ParticleNetJet_EdgeConv1_act1[0][
__________________________________________________________________________________________________
ParticleNetJet_EdgeConv1_sc_con (None, 25, 1, 128)   8192        tf_op_layer_ExpandDims_6[0][0]   
__________________________________________________________________________________________________
ParticleNetJet_EdgeConv1_bn2 (B (None, 25, 5, 128)   512         ParticleNetJet_EdgeConv1_conv2[0]
__________________________________________________________________________________________________
ParticleNetJet_EdgeConv1_sc_bn  (None, 25, 1, 128)   512         ParticleNetJet_EdgeConv1_sc_conv[
__________________________________________________________________________________________________
ParticleNetJet_EdgeConv1_act2 ( (None, 25, 5, 128)   0           ParticleNetJet_EdgeConv1_bn2[0][0
__________________________________________________________________________________________________
tf_op_layer_Squeeze_2 (TensorFl (None, 25, 128)      0           ParticleNetJet_EdgeConv1_sc_bn[0]
__________________________________________________________________________________________________
tf_op_layer_Mean_1 (TensorFlowO (None, 25, 128)      0           ParticleNetJet_EdgeConv1_act2[0][
__________________________________________________________________________________________________
jetvars (InputLayer)            [(None, 13)]         0                                            
__________________________________________________________________________________________________
tf_op_layer_add_9 (TensorFlowOp (None, 25, 128)      0           tf_op_layer_Squeeze_2[0][0]      
                                                                 tf_op_layer_Mean_1[0][0]         
__________________________________________________________________________________________________
L16 (Dense)                     (None, 16)           224         jetvars[0][0]                    
__________________________________________________________________________________________________
ParticleNetJet_EdgeConv1_sc_act (None, 25, 128)      0           tf_op_layer_add_9[0][0]          
__________________________________________________________________________________________________
DO16 (Dropout)                  (None, 16)           0           L16[0][0]                        
__________________________________________________________________________________________________
tf_op_layer_Mul_13 (TensorFlowO (None, 25, 128)      0           ParticleNetJet_EdgeConv1_sc_act[0
                                                                 tf_op_layer_Cast[0][0]           
__________________________________________________________________________________________________
L8 (Dense)                      (None, 8)            136         DO16[0][0]                       
__________________________________________________________________________________________________
tf_op_layer_Mean_2 (TensorFlowO (None, 128)          0           tf_op_layer_Mul_13[0][0]         
__________________________________________________________________________________________________
DO8 (Dropout)                   (None, 8)            0           L8[0][0]                         
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 136)          0           tf_op_layer_Mean_2[0][0]         
                                                                 DO8[0][0]                        
__________________________________________________________________________________________________
dense (Dense)                   (None, 256)          35072       concatenate[0][0]                
__________________________________________________________________________________________________
dropout (Dropout)               (None, 256)          0           dense[0][0]                      
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 2)            514         dropout[0][0]                    
==================================================================================================
Total params: 105,534
Trainable params: 103,988
Non-trainable params: 1,546
__________________________________________________________________________________________________


    Running on test sample. This may take a moment. . .


    Test Area under Curve = 0.9938278373238278


 ... x-check, probs size: 
 0          1.812660e-05
1          4.064842e-04
2          6.544391e-05
3          9.800797e-01
4          4.021436e-09
               ...     
3833879    1.000000e+00
3833905    9.999690e-01
3833907    9.986048e-01
3833909    9.892871e-01
3833915    9.993205e-01
Name: sigprob, Length: 3833917, dtype: float32
    /nfs/dust/cms/user/heikenju/ML_LLP/GraphNetJetTaggerCalo/model_weights_graphnet/v3_calo_AOD_2018_v4/model_particle_net_jet_10-4/test_score_10-4_signal_matched_Jet_isGenMatchedCaloCorrLLPAccept.h5 stored
 ... x-check, back size:  3561362
 ... x-check, sign size:  272555
 ... x-check, back naive integral:  54396.80972629574
 ... x-check, sign naive integral:  265009.0117547061
 ... x-check, back weight integral:  0.999999804231582
 ... x-check, sign weight integral:  0.999999999999549
 ... x-check, back comb integral:  0.01935003446219009
 ... x-check, sign comb integral:  0.972498133657614
Integral S:  0.020408163265306357
Integral B:  0.02040815927000476
    Plots printed in /nfs/dust/cms/user/heikenju/ML_LLP/GraphNetJetTaggerCalo/model_weights_graphnet/v3_calo_AOD_2018_v4/model_particle_net_jet_10-4/


